package com.example.math_test;
import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.view.View;
import android.widget.Button;
import android.widget.EditText;
import android.widget.TextView;


public class xndirner extends AppCompatActivity implements View.OnClickListener{
    private TextView tx1, tx2, tx3;
    private EditText ansver;
    private Button btn1, btn2;
    int num1;
    int x1;



    String h= "";

    String[] items = {"5 կգ խաղող վաճառելուց հետո արկղում մնաց 23 կգ: Որքա՞ն խաղող կար արկղում:",
            "Երկու թվերի գումարը 57 է: Գումարելիներից մեկը 6 է: Ո՞րն է մյուս գումարելին: ",
            "Երեք արկղում կա 76 կգ խնձոր: Առաջինում կա 22 կգ, երկրորդում՝ 23 կգ: Որքա՞ն խնձոր կա երրորդ արկղում:",
            "Ուղղանկյունաձև հողամասի երկարությունը 25 մ է, իսկ լայնությունը՝ 18 մ: Որքա՞ն է այդ հողամասի ցանկապատի երկարությունը: ",
            "Արան ունի 20 դրամ, իսկ Անին՝ 3 անգամ շատ: Որքա՞ն դրամ ունի Անին:",
            "Հայրիկը գնել է 4 ձմերուկ, յուրաքանչյուրը՝ 5 կգ: Քանի՞ կիլոգրամ ձմերուկ է գնել հայրիկը:",
            "Քանի՞ ցատկ պետք է կատարի կենգուրուն 24 մ հեռավորություն անցնելու համար, եթե նրա մեկ ցատկի երկարությունը 3 մ է: ",
            "Արամը մտապահել է 28 թիվը, որը 4 անգամ մեծ է Սոնայի մտապահածից: Որքա՞ն է նրանց մտապահած թվերի գումարը:",
            "Հայկը հավաքեց 300 գ ելակ, իսկ Անին՝ 200 գ-ով ավելի: Որքա՞ն ելակ հավաքեցին նրանք միասին:",
            "1 տուփ կարագի զանգվածը 200 գ է: Աննան գնել է 3 տուփ կարագ: Քանի՞ գրամ կարագ է գնել Աննան: ",
            "Մի տակառում կա 420 լիտր հյութ, իսկ մյուսում՝ 140 լիտրով պակաս: Քանի՞ լիտր հյութ կա երկու տակառներում միասին: ",
            "Հասմիկը 45 սմ երկարությամբ ժապավենը բաժանեց 9 հավասար մասերի: Որքա՞ն է յուրաքանչյուր մասի երկարությունը: ",
            "Ծաղկամանում կա 8 կարմիր և 2 անգամ քիչ սպիտակ մեխակ: Ընդամենը քանի՞ մեխակ կա այդ ծաղկամանում: ",
            "Սոնան ուներ 540 դրամ: Ժապավեն գնելուց հետո նրա մոտ մնաց 280 դրամ: Սոնան որքա՞ն վճարեց ժապավենի համար:",
            "Արամն ու Հայկը միասին ունեին 6500 դրամ: Արամն իր գումարից ծախսեց 1000 դրամ, իսկ Հայկը՝ 500 դրամ: Որքա՞ն դրամ մնաց նրանց մոտ: ",
            "Եթե մեկ գրիչն արժենա 40 դրամ, իսկ մեկ տետրը՝ 65 դրամ, ապա որքա՞ն պետք է վճարել 2 գրիչի և 10 տետրի համար:",
            "Օրագիրն արժե 420 դրամ, իսկ տետրը՝ 6 անգամ պակաս: Որքա՞ն պետք է վճարել 1 օրագրի և 2 տետրի համար:",
            "Եթե Սոնայի մտապահած թիվը կրկնապատկենք, կստանանք 180-ից 20 միավորով փոքր թիվ: Ո՞ր թիվն է մտապահել Սոնան:",
            "Դպրոցի ճաշարանում կա 20 սեղան և 102 աթոռ: Քանի՞ աթոռ կավելանա, եթե յուրաքանչյուր սեղանի շուրջ դրվի 4 աթոռ:",
            "Մայրիկը Անիից մեծ է 21 տարով: 7 տարի հետո մայրիկը Աննայից քանի՞ տարով մեծ կլինի:",
            "Առաջին օրը Աննան կարդաց 25 էջ, իսկ երկրորդ օրը՝ 12 էջով ավելի: Քանի՞ էջ կարդաց Աննան երկու օրում: ",
            "6 մատիտի համար Հասմիկը վճարեց 480 դրամ: Որից հետո մատիտի գինը էժանացավ 20 դրամով: Որքա՞ն արժե այժմ մեկ մատիտը:",
            "40 կգ ալյուրը հավասարապես լցված է 5 պարկի մեջ: Քանի՞ կգ ալյուր է լցված դրանցից միայն 3-ի մեջ: ",
            "1 կգ աղցանը պարունակում է 470 գ կաղամբ, 260 գ գազար, 50 գ կանաչի և բազուկ: Որքա՞ն բազուկ կա այդ աղցանի մեջ: ",
            "Աննան գնել է 4 պաղպաղակ, իսկ Աշոտը՝ 5: Որքա՞ն գումար է վճարել Աշոտը, եթե Աննան վճարել է 360 դրամ: ",
            "5 կգ շաքարավազն արժե 1500 դրամ: Որքա՞ն պետք է վճարել 8 կգ շաքարավազ գնելու համար: ",
            "3 ավտոմեքենա կարող են տեղափոխել 12 ուղևոր: Քանի՞ ուղևոր կարող են տեղափոխել 8 այդպիսի ավտոմեքենաներ:",

    };
    int [] cAnswer ={28 ,  51 ,   31,  86 ,   60 ,  20 ,  8 ,  35 ,  800,  600 ,
            700,  5 , 12, 260 ,  5000, 730 ,   560 ,   80, 22,
            21,  62, 60,   24,  220,  450,  2400, 32   };

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_xndirner);
        tx1 = (TextView) findViewById(R.id.textView71);
        tx2 = (TextView) findViewById(R.id.textView72);
        tx3 = (TextView) findViewById(R.id.textView73);
        ansver = (EditText) findViewById(R.id.editText13);
        btn1 = (Button) findViewById(R.id.button21);
        btn2 = (Button) findViewById(R.id.button22);
        btn1.setOnClickListener(this);
        btn2.setOnClickListener(this);
        ansver.setText("");


    }

    @Override
    public void onClick(View view) {


        if (view.getId() == R.id.button21) {
            x1 = (int) (Math.random() * items.length - 1);
            tx1.setText(items[x1]);
            ansver.setText("");
            tx3.setText("" );
        }


        if (view.getId() == R.id.button22) {
            if (ansver.getText().toString().equals("")){
                tx3.setText("ВВедите ответ");
            }
            else {
            h = ansver.getText().toString();
            int patasxan = Integer.parseInt(h);

            if (cAnswer[x1] == patasxan) {


                tx3.setText("Ответ правильный");

            } else {

                tx3.setText("Ответ неправильный");


            }
            }

        }


    }
}
